src/Catalogs/ШаблоныТекстаРеквизитовОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ШаблоныТекстаРеквизитовОбследований</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодчиненРеквизиту</Name>
					<Comment>Подчинен реквизиту обследования</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыОбследований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодчиненДиагнозу</Name>
					<Comment>Подчинение в разрезе диагноза</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор текстового шаблона</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ЗначенияПараметровОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПараметровОбследований</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Comment>Порядок вывода реквизита в документе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонОбследования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОбследований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыОбследований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Зуб</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Зубы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОбращения</v8:Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗначенияПараметровОбследований</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ChartsOfCharacteristicTypes/ПараметрыОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ПараметрыОбследований</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.ПричиныОбращения</v8:Type>
				<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияПараметровОбследований</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>10</v8:Digits>
					<v8:FractionDigits>3</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПараметра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПараметровШаблоновОбследований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритВычисления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПривязкаКЗубам</Name>
					<Comment>Данный параметр составной</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодчиненРеквизиту</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыОбследований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/Catalogs/ШаблоныТекстаРеквизитовОбследований/Forms/ФормаВводаТекстаРеквизита/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// При создании формы на сервере 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	ВводимыйТекст       = Неопределено;
	Параметры.Свойство("ПодчиненныйРеквизит" 	, ПодчиненРеквизиту);
	Параметры.Свойство("ПодчиненДиагнозу"    	, ПодчиненДиагнозу);
	Параметры.Свойство("Текст"               	, ВводимыйТекст);
	Параметры.Свойство("СоставнойПодборРежим"	, СоставнойПодборРежим);
	Параметры.Свойство("ШаблонОбследования"	 	, ШаблонОбследования);
	Параметры.Свойство("Прием"	 				, Прием);
	
	Если Параметры.Свойство("ПараметрыОбследования") Тогда
		ПараметрыОбследования = Параметры.ПараметрыОбследования;	
	КонецЕсли;
	// Составной режим подбора
	Если СоставнойПодборРежим Тогда
		Параметры.Свойство("ТипЗубнойФормулы",ТипЗубнойФормулы);
		Если Параметры.Свойство("Зуб") И ЗначениеЗаполнено(Параметры.Зуб) Тогда
			Если ТипЗнч(Параметры.Зуб) = Тип("Массив") Тогда
				МассивВыделенныхЗубов.ЗагрузитьЗначения(Параметры.Зуб);
			Иначе
				МассивВыделенныхЗубов.Добавить(Параметры.Зуб);			
			КонецЕсли;
			ПредЗуб = Параметры.Зуб;
		КонецЕсли;
		ВидимостьПереключателя                  = Параметры.Свойство("РазрешитьМножественныйВыбор") И Параметры.РазрешитьМножественныйВыбор = Истина;
		Элементы.ФормаУдалитьРеквизит.Видимость = Истина;
		УстановитьЗубнуюФормулу();
	Иначе
		Элементы.ГруппаПодборЗубов.Видимость    = Ложь;
		Элементы.ФормаУдалитьРеквизит.Видимость = Ложь;
	КонецЕсли;	
	
	МассивДиагнозов = Новый Массив;
	Если ЗначениеЗаполнено(ПодчиненДиагнозу) Тогда
		МассивДиагнозов.Добавить(ПодчиненДиагнозу);	
	Иначе
		Для Каждого Элемент Из ПараметрыОбследования Цикл
			Если Элемент.Реквизит.Наименование = "Диагноз" Тогда
				МассивДиагнозов.Добавить(Элемент.РеквизитЗначение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// Установка фильтров отбора шаблонов
	СписокШаблонов.Параметры.УстановитьЗначениеПараметра("ПодчиненРеквизиту",ПодчиненРеквизиту);
	СписокШаблонов.Параметры.УстановитьЗначениеПараметра("Диагноз"          ,ЗначениеЗаполнено(МассивДиагнозов));  
	СписокШаблонов.Параметры.УстановитьЗначениеПараметра("МассивДиагнозов"          ,МассивДиагнозов);  
	
	Если ЗначениеЗаполнено(ПодчиненРеквизиту) Тогда
		ЭтаФорма.Заголовок = Строка(ПодчиненРеквизиту);
	КонецЕсли;
	
	ЗаблокироватьЗаписиПоПриему(Прием, Отказ);
	
	// Формируем переключатель закладок и таблицу вводимого текста
	//Для Каждого Элемент Из ШаблонОбследования.СоответствияПараметрам Цикл
	//	Если Элемент.Параметр.Наименование <> "Диагноз" Тогда
	//		СтрокаМеню = СтруктураМеню.Добавить(); 
	//		СтрокаМеню.ЗначениеМеню = Элемент.Параметр;
	//		СтрокаМеню.ЗначениеБезПробелов = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(" ,",Элемент.Параметр, "");
	//		ЗначениеОбследования = ПараметрыОбследования.НайтиСтроки(Новый Структура("Реквизит",Элемент.Параметр));
	//		Если ЗначениеОбследования.Количество() > 0 Тогда 
	//			Для Каждого Элемент Из ЗначениеОбследования Цикл
	//				ИскомаяСтрокаТаблицы =  ТалицаВводимогоТекста.НайтиСтроки(Новый Структура("Реквизит, ЗубЗначение",Элемент.Реквизит, Элемент.ЗубЗначение)); 
	//				Если ЗначениеЗаполнено(ИскомаяСтрокаТаблицы) Тогда
	//					ИскомаяСтрокаТаблицы[0].ВводимыйТекст 			= ИскомаяСтрокаТаблицы[0].ВводимыйТекст + Символы.ПС + Элемент.РеквизитЗначениеСтрокой; 
	//					ИскомаяСтрокаТаблицы[0].РеквизитЗначениеСтрокой = ИскомаяСтрокаТаблицы[0].РеквизитЗначениеСтрокой + Символы.ПС + Элемент.РеквизитЗначениеСтрокой;
	//					ИскомаяСтрокаТаблицы[0].РеквизитЗначение 		= ИскомаяСтрокаТаблицы[0].РеквизитЗначение + Символы.ПС + Элемент.РеквизитЗначение;
	//				Иначе
	//					НоваяСтрока = ТалицаВводимогоТекста.Добавить();
	//					НоваяСтрока.ЗначениеЗакладки 		= СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(" ,",Элемент.Реквизит.Наименование, "");
	//					НоваяСтрока.ВводимыйТекст 	 		= НоваяСтрока.ВводимыйТекст + Элемент.РеквизитЗначениеСтрокой;
	//					НоваяСтрока.ЗубЗначение 	 		= Элемент.ЗубЗначение; 
	//					НоваяСтрока.РеквизитИдентификатор 	= Элемент.РеквизитИдентификатор;
	//					НоваяСтрока.РеквизитЗначениеСтрокой = Элемент.РеквизитЗначениеСтрокой;
	//					НоваяСтрока.РеквизитЗначение        = Элемент.РеквизитЗначение;
	//					НоваяСтрока.Реквизит                = Элемент.Реквизит;
	//					НоваяСтрока.ЗубИдентификатор        = Элемент.ЗубИдентификатор;
	//				КонецЕсли;
	//			КонецЦикла;
	//		КонецЕсли; 
	//	КонецЕсли;
	//КонецЦикла;
	//ПредЗакладка = СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(" ,",ПодчиненРеквизиту, "");
	//Если Не ЗначениеЗаполнено(ПредЗуб) Тогда
	//	ПредЗуб = Перечисления.Зубы.ПустаяСсылка();
	//КонецЕсли;
	//СоздатьДинамическиеКнопки(СтруктураМеню);
	//УстановитьАктивнуюЗакладку(СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(" ,",ПодчиненРеквизиту.Наименование, ""));
	//МассивТекст = ТалицаВводимогоТекста.НайтиСтроки(Новый Структура("Реквизит, ЗубЗначение",ПодчиненРеквизиту, ПредЗуб));
	//Если ЗначениеЗаполнено(МассивТекст) Тогда
	//	ВводимыйТекст = МассивТекст[0].ВводимыйТекст;                            
	//КонецЕсли;
	ПолучитьВысотуSVGПодпора();
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
 	
КонецПроцедуры

&НаКлиенте
// Обработчик при открытии формы на клиенте
//
Процедура ПриОткрытии(Отказ)
	Если СоставнойПодборРежим Тогда
     	 ОбновитьSVGПодбор();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Завершить ввод текста, закрыть форму
//
Процедура Ок(Команда)  
	
	СтандартнаяОбработка = Ложь;
	ВыделенныеЗубы = ?(МассивВыделенныхЗубов <> Неопределено, МассивВыделенныхЗубов.ВыгрузитьЗначения(), Неопределено);
	Значение = Новый Структура("Зубы, Текст", ВыделенныеЗубы, ВводимыйТекст);
	Если Не ЗначениеЗаполнено(ВыделенныеЗубы) И Не ЗначениеЗаполнено(ВводимыйТекст) Тогда  
		Значение.Вставить("УдалитьРеквизит", Истина);
	КонецЕсли;
	Значение.Вставить("ИдентификаторБлокируемойФормы", Этаформа.УникальныйИдентификатор);
	Закрыть(Значение);
	
КонецПроцедуры

&НаКлиенте
// Передать в род. форму признак удаления реквизита
//
Процедура УдалитьРеквизит(Команда)
	Закрыть(Новый Структура("Зуб,Текст,УдалитьРеквизит",Неопределено,Неопределено,Истина));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Обработчик выбора значения из списка
//
Процедура СписокШаблоновВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	
	СтандартнаяОбработка = Ложь;
	Если ВыбраннаяСтрока <> Неопределено
		И Элемент.ТекущиеДанные <> Неопределено
		И НЕ Элемент.ТекущиеДанные.ЭтоГруппа Тогда
		
		ВводимыйТекст = ВводимыйТекст + ?(ВводимыйТекст <> "",". ","") + ПолучитьТекстШаблона(ВыбраннаяСтрока);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик перед началом добавления строки
//
Процедура СписокШаблоновПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	Если Группа Тогда
		ФормаГруппы = ПолучитьФорму("Справочник.ШаблоныТекстаРеквизитовОбследований.Форма.ФормаГруппы",Новый Структура("ЭтоГруппа",Истина),ЭтаФорма);
		ФормаГруппы.Объект.ПодчиненРеквизиту = ПодчиненРеквизиту;
		ФормаГруппы.Объект.ПодчиненДиагнозу  = ПодчиненДиагнозу;
		ФормаГруппы.СкрытьНеОсновныеЭлементы();
		ФормаГруппы.Открыть();
	Иначе	
		Основание     = Новый Структура("Родитель,ПодчиненРеквизиту,ТекстШаблона,ПодчиненДиагнозу,ОкрытИзСписка",Родитель,ПодчиненРеквизиту,ВводимыйТекст,ПодчиненДиагнозу, Истина);
		ФормаЭлемента = ПолучитьФорму("Справочник.ШаблоныТекстаРеквизитовОбследований.ФормаОбъекта",Новый Структура("Основание",Основание),ЭтаФорма);
		//ФормаЭлемента.СкрытьНеОсновныеЭлементы();
		ФормаЭлемента.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
// При нажатии на форму подбора
//
Процедура ПодборЗубовПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ДанныеСобытия.Element.parentNode = Неопределено Тогда 
		//МассивВыделенныхЗубов = Неопределено;
		Возврат;
	КонецЕсли;
		
	ДанныеЭлемента = ДанныеСобытия.Element.parentNode.id; //ДанныеСобытия.element.id;
	
	Если ДанныеЭлемента = "Switch" тогда
		МассивВыделенныхЗубов.Очистить();
		ТипЗубнойФормулы         = ?(ТипЗубнойФормулы = 1, 0, 1);
		SVGВыделенныйЗуб         = "var selectzub"; 
		SVGМассивВыделенныхЗубов = "var SelectedTeeth = [];";			
		УстановитьЗубнуюФормулу();
		ОбновитьSVGПодбор();
	КонецЕсли;

	Если ДанныеЭлемента = "МножественныйРежимВыделения" ИЛИ ДанныеЭлемента = "ОдиночныйРежимВыделения" тогда
		РазрешитьМножественныйВыбор = ДанныеЭлемента = "МножественныйРежимВыделения";
	КонецЕсли;

	Если ДанныеЭлемента = "Del" Тогда
		МассивВыделенныхЗубов.Очистить();
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеЭлемента) и Найти(ДанныеЭлемента, "Зуб") > 0  Тогда
		Зуб = ДанныеЭлемента;
		Если Найти(Зуб, "Зуб") > 0 Тогда
			Зуб = ПредопределенноеЗначение("Перечисление.Зубы."+Зуб);
		Иначе
			Возврат;
		КонецЕсли;
		
		Если РазрешитьМножественныйВыбор Тогда
			НайденныйЭл = МассивВыделенныхЗубов.НайтиПоЗначению(Зуб);
			Если НайденныйЭл <> Неопределено Тогда			
				МассивВыделенныхЗубов.Удалить(НайденныйЭл);
			Иначе
				МассивВыделенныхЗубов.Добавить(Зуб);				
			КонецЕсли;		
		Иначе
			
			Если МассивВыделенныхЗубов.Количество() > 0 и Зуб = МассивВыделенныхЗубов[0].Значение Тогда
				МассивВыделенныхЗубов.Очистить();
			Иначе
				МассивВыделенныхЗубов.Очистить();
				МассивВыделенныхЗубов.Добавить(Зуб);
			КонецЕсли;
			
		КонецЕсли;
		
		//ИскомаяЗакладка = ТалицаВводимогоТекста.НайтиСтроки(Новый Структура("ЗначениеЗакладки, ЗубЗначение", ПредЗакладка, ПредЗуб));
		//
		//Если ИскомаяЗакладка.Количество() > 0 Тогда
		//	ИскомаяЗакладка[0].ВводимыйТекст = ВводимыйТекст;
		//	ИскомаяЗакладка[0].ЗубЗначение = ПредЗуб;
		//ИначеЕсли ЗначениеЗаполнено(ВводимыйТекст) Тогда
		//	НоваяСтрока = ТалицаВводимогоТекста.Добавить();
		//	НоваяСтрока.ЗначениеЗакладки 		= ПредЗакладка;
		//	НоваяСтрока.ВводимыйТекст 	 		= ВводимыйТекст;
		//	НоваяСтрока.ЗубЗначение 	 		= ?( ЗначениеЗаполнено(ПредЗуб), ПредЗуб, Зуб);
		//	НоваяСтрока.РеквизитИдентификатор 	= Новый УникальныйИдентификатор;  
		//	
		//	НоваяСтрока.РеквизитЗначениеСтрокой = ВводимыйТекст;
		//	НоваяСтрока.РеквизитЗначение        = ВводимыйТекст;
		//	НоваяСтрока.Реквизит                = Неопределено;
		//	НоваяСтрока.ЗубИдентификатор        = Новый УникальныйИдентификатор;
		//	
		//	НашаЗакладка = Элементы.Найти(ПредЗакладка);
		//	НашаЗакладка.Заголовок = НашаЗакладка.Заголовок + "(" + Строка(?( ЗначениеЗаполнено(ПредЗуб), ПредЗуб, Зуб)) + ")";
		//КонецЕсли;
		//ПредЗуб = Зуб;
		//Если МассивВыделенныхЗубов.Количество() = 0 Тогда
		//	ПредЗуб = ПредопределенноеЗначение("Перечисление.Зубы.ПустаяСсылка");	
		//КонецЕсли;
		//ИскомаяЗакладка = ТалицаВводимогоТекста.НайтиСтроки(Новый Структура("ЗначениеЗакладки, ЗубЗначение", ПредЗакладка, ПредЗуб));
		//Если ИскомаяЗакладка.Количество() > 0 Тогда
		//	ВводимыйТекст = ИскомаяЗакладка[0].ВводимыйТекст;
		//Иначе
		//	ВводимыйТекст = "";
		//КонецЕсли; 
		//ОбновитьSVGПодбор();
	КонецЕсли;	


КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура, обновляет картинку подбора зубов
//
Процедура ОбновитьSVGПодбор()
	
	Если МассивВыделенныхЗубов.Количество() > 0 Тогда
		мЗуб = СтрЗаменить(Строка(МассивВыделенныхЗубов[0].Значение), "Зуб", "");
		Svg  = СтрЗаменить(Svg, SVGВыделенныйЗуб, "var selectzub = '"+мЗуб+"';");	
		SVGВыделенныйЗуб = "var selectzub = '"+мЗуб+"';";
	Иначе
	   	Svg  = СтрЗаменить(Svg, SVGВыделенныйЗуб, "var selectzub;");	
		SVGВыделенныйЗуб = "var selectzub;";
	КонецЕсли;
	
	мМассив                 = "mas='";
	мМассив                 = мМассив + "';";
	SVGМассивЛечащихсяЗубов = "var mas='';";
	Svg                     = СтрЗаменить(Svg, SVGМассивЛечащихсяЗубов, мМассив);
	SVGМассивЛечащихсяЗубов = мМассив;
	
	мМассив = "var SelectedTeeth = [";
	Для Каждого строкаТЧ из МассивВыделенныхЗубов Цикл
		мМассив = мМассив + "'Цвет"+строкаТЧ.Значение+"',";		
	КонецЦикла;
	Если СтрДлина(мМассив) > 21 Тогда
		мМассив = Сред(мМассив, 1, СтрДлина(мМассив)-1);
	КонецЕсли;
	мМассив                  = мМассив + "];";
	Svg                      = СтрЗаменить(Svg, SVGМассивВыделенныхЗубов, мМассив);
	SVGМассивВыделенныхЗубов = мМассив;
	Svg = СтрЗаменить(Svg, "135px", ВысотаSVGПодбора);
	
	ПодборЗубов              = Svg;	
	
	
	
	
	Если ЗначениеЗаполнено(ПредЗакладка) Тогда
		ИскомаяЗакладка = ТалицаВводимогоТекста.НайтиСтроки(Новый Структура("ЗначениеЗакладки", ПредЗакладка));
		МассивВыделенныхЗубов.Очистить();
		Для Каждого Элемент Из ИскомаяЗакладка Цикл 
			Если ЗначениеЗаполнено(Элемент.ЗубЗначение) Тогда
				МассивВыделенныхЗубов.Добавить(Элемент.ЗубЗначение);	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

  //  Если МассивВыделенныхЗубов.Количество() > 0 Тогда
  //  	мЗуб = СтрЗаменить(Строка(МассивВыделенныхЗубов[0].Значение), "Зуб", "");
  //  	Svg  = СтрЗаменить(Svg, SVGВыделенныйЗуб, "var selectzub = '"+мЗуб+"';");	
  //  	SVGВыделенныйЗуб = "var selectzub = '"+мЗуб+"';";
  //  Иначе
  //     	Svg  = СтрЗаменить(Svg, SVGВыделенныйЗуб, "var selectzub;");	
  //  	SVGВыделенныйЗуб = "var selectzub;";
  //  КонецЕсли;
  //  
  //  Если СоставнойПодборРежим Тогда
  //  	Svg = СтрЗаменить(Svg, "var FlagSinglSelect = true;", "var FlagSinglSelect = false;");
  //  Иначе
  //  	Svg = СтрЗаменить(Svg, "var FlagSinglSelect = false;", "var FlagSinglSelect = true;");
  //  КонецЕсли;
  //
  //  мМассив = "mas='"; 
  //  МассивЗаполненыхЗубов = ТалицаВводимогоТекста.НайтиСтроки(Новый Структура("ЗначениеЗакладки", ПредЗакладка));
  //  Для Каждого строкаТЧ из МассивЗаполненыхЗубов Цикл
  //  	Если Найти(мМассив, Строка(строкаТЧ.ЗубЗначение)) = 0 И НЕ строкаТЧ.ЗубЗначение = ПредопределенноеЗначение("Перечисление.Зубы.ПустаяСсылка") Тогда
  //  		мМассив = мМассив +СтрокаТЧ.ЗубЗначение +",";
  //  	КонецЕсли;
  //  КонецЦикла;
  //  Если СтрДлина(мМассив) > 5 Тогда
  //  	мМассив = Сред(мМассив, 1, СтрДлина(мМассив)-1);
  //  КонецЕсли;
  //  
  //  Если СтрНайти(Svg, "var mas='';") > 0 Тогда
  //  	SVGМассивЛечащихсяЗубов  =  "var mas='';"; 
  //  Иначе
  //  	ПозицияВСтроке = СтрНайти(Svg, "mas='");
  //  	SVGМассивЛечащихсяЗубов = "";
  //  	Для Счетчик = ПозицияВСтроке По СтрДлина(Svg) Цикл
  //  		НужныйСимвол = Сред(Svg, Счетчик, 1);
  //          SVGМассивЛечащихсяЗубов = SVGМассивЛечащихсяЗубов + НужныйСимвол;
  //  		Если НужныйСимвол = ";" Тогда 
  //  			Прервать;	
  //  		КонецЕсли;
  //  	КонецЦикла;
  //  КонецЕсли;
  // 
  //  мМассив                  = мМассив + "';";
  //  Svg                      = СтрЗаменить(Svg, SVGМассивЛечащихсяЗубов, мМассив);	
  //  SVGМассивЛечащихсяЗубов = мМассив;
  //  
  //  мМассив = "var SelectedTeeth = [";
  //  Для Каждого строкаТЧ из МассивВыделенныхЗубов Цикл
  //  	мМассив = мМассив + "'Цвет"+строкаТЧ.Значение+"',";		
  //  КонецЦикла;
  //  Если СтрДлина(мМассив) > 21 Тогда
  //  	мМассив = Сред(мМассив, 1, СтрДлина(мМассив)-1);
  //  КонецЕсли;
  //  мМассив = мМассив + "];";
  //  Svg = СтрЗаменить(Svg, SVGМассивВыделенныхЗубов, мМассив);
  //  SVGМассивВыделенныхЗубов = мМассив;	
  //  
  //  Svg = СтрЗаменить(Svg, "135px", ВысотаSVGПодбора);

  //  ПодборЗубов        = Svg;
	
КонецПроцедуры 

&НаСервере
// Процедура, выполняет получение макета ЗФ
//
Процедура УстановитьЗубнуюФормулу()
	
	SVGВыделенныйЗуб             = "var selectzub"; 
	SVGМассивВыделенныхЗубов     = "var SelectedTeeth = [];";

    ПодборЗубов = "<HTML xmlns='http://www.w3.org/1999/xhtml'>
	|<META contect='text/html; charset=utf-8' http-equiv='Content-Type'></META><LINK rel='stylesheet' type='text/css' href='__STYLE__'></LINK>
	|<META name='GENERATOR' content='MSHTML 8.00.6001.18702'></META>
	|<BASE href='v8config://v8cfgHelp/mdobject/id8d74233b-feb6-4170-918c-dfe5689c9b14/8eb4fad1-1fa6-403e-970f-2c12dbb43e23'></BASE>
	|<HEAD>
	|
	|<STYLE type=text/css>BODY {
	|	PADDING-BOTTOM: 0px; BACKGROUND-COLOR: #fff; MARGIN: 0px; PADDING-LEFT: 0px; PADDING-RIGHT: 0px; FONT: 13px Veranda,Arial,helv; OVERFLOW: auto; PADDING-TOP: 0px
	|}
	|TABLE {
	|	FONT: 13px Veranda,Arial,helv
	|}
	|TD {
	|	FONT: 13px Veranda,Arial,helv
	|}
	|.Level1 {
	|	BACKGROUND-IMAGE: url('../../mdpicture/id7b596014-1162-4a35-bf29-02d313671e51/00000000-0000-0000-0000-000000000000'); BORDER-BOTTOM: white 1px solid; TEXT-ALIGN: center; LINE-HEIGHT: 22px; BACKGROUND-COLOR: #c5374e; FONT-FAMILY: ""Arial""; HEIGHT: 22px; COLOR: white; FONT-SIZE: 16px; VERTICAL-ALIGN: middle; FONT-WEIGHT: bold
	|}
	|.Level2 {
	|	BACKGROUND-IMAGE: url('../../mdpicture/id2454bd49-37b5-4de4-a308-0c3acf8c4c6c/00000000-0000-0000-0000-000000000000'); BORDER-BOTTOM: white 1px solid; TEXT-ALIGN: center; LINE-HEIGHT: 18px; BACKGROUND-COLOR: #1a3867; FONT-FAMILY: ""Arial""; HEIGHT: 18px; COLOR: white; FONT-SIZE: 12px; VERTICAL-ALIGN: middle; FONT-WEIGHT: bold
	|}
	|.LevelDown {
	|	FONT-FAMILY: ""Arial""; COLOR: black; FONT-SIZE: 12px; CURSOR: pointer; FONT-WEIGHT: bold; HEIGHT: 22px; LINE-HEIGHT: 22px; VERTICAL-ALIGN: middle;
	|}
	|.BORDERBOTTOMLINE {
	|	BORDER-BOTTOM: #aeafb0 1px solid;
	|}
	|
	|</STYLE></HEAD>
	|
	|<BODY bgColor=#ffffff><IMG src=""D:\FormulaPodbor.svg"">
	|</BODY></HTML>";

	
	Если ТипЗубнойФормулы = 1 Тогда
		mSvg  = ПолучитьОбщийМакет("SVGПодборДетский").ПолучитьТекст();
	Иначе
		mSvg  = ПолучитьОбщийМакет("SVGПодборВзрослый").ПолучитьТекст();
	КонецЕсли;
	
	mHTML = ПолучитьОбщийМакет("HTMLДокумент").ПолучитьТекст();
	Svg   = СтрЗаменить(mHTML, "SVGElement", mSvg);
	Svg   = СтрЗаменить(Svg, "document.getElementById('Layer_1').setAttributeNS(null, 'height', window.innerHeight+'px')", "document.getElementById('Layer_1').setAttributeNS(null, 'height', (window.innerHeight - 15)+'px')");
	Если НЕ ВидимостьПереключателя Тогда
		Svg   = СтрЗаменить(Svg, "var ViewSelect = true;", "var ViewSelect = false;" );
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
// Получить текста шаблона
//
Функция ПолучитьТекстШаблона(ЭлементСпр)
	Возврат ЭлементСпр.ТекстШаблона;	
КонецФункции

&НаСервере
// Процедура, Получить высоту SVG подбора
//
Процедура ПолучитьВысотуSVGПодпора();
	
	РазрешениеЭкрана = ОбщегоНазначенияКлиентСерверСтоматология.ОпределитьТекущееРазрешениеЭкрана();
	ШиринаЭкрана	 = Сред(РазрешениеЭкрана, 1, Найти(РазрешениеЭкрана, "*") - 1);
	
	Если ШиринаЭкрана = "1280" Тогда 
		ВысотаSVGПодбора = "83px";
		ЭтаФорма.Масштаб = 88;
	ИначеЕсли ШиринаЭкрана = "1360" Тогда 
		ВысотаSVGПодбора = "85px";
		ЭтаФорма.Масштаб = 94;
	ИначеЕсли ШиринаЭкрана = "1366" Тогда 
		ВысотаSVGПодбора = "85px";
		ЭтаФорма.Масштаб = 94;
	ИначеЕсли ШиринаЭкрана = "1400" Тогда 
		ВысотаSVGПодбора = "93px";		
		ЭтаФорма.Масштаб = 95;
	ИначеЕсли ШиринаЭкрана = "1440" Тогда 
		ВысотаSVGПодбора = "95px";	
	ИначеЕсли ШиринаЭкрана = "1600" Тогда 
		ВысотаSVGПодбора = "94px";		
	ИначеЕсли ШиринаЭкрана = "1680" Тогда 
		ВысотаSVGПодбора = "95px";     
	ИначеЕсли ШиринаЭкрана = "1920" Тогда 
		ВысотаSVGПодбора = "95px";		  
	Иначе
		ВысотаSVGПодбора = "135px";
	КонецЕсли;	

КонецПроцедуры

&НаСервере
// Создать динамические элементы.
//
Процедура СоздатьДинамическиеКнопки(СтруктураМеню)
	
	ОснГруппа = Элементы.ГруппаОбследование;
	Пока ОснГруппа.ПодчиненныеЭлементы.Количество() > 1 Цикл
		Элементы.Удалить(ОснГруппа.ПодчиненныеЭлементы[1]);
	КонецЦикла;
	
	Индекс = 0;

	Для Каждого Элемент Из СтруктураМеню Цикл
		НоваяГруппа             = Элементы.Добавить("ГруппаКнопок_" + Индекс, Тип("ГруппаФормы"), ОснГруппа);
		НоваяГруппа.Вид 		= ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная; 
		НоваяГруппа.РастягиватьПоГоризонтали = Истина;
		//НоваяГруппа.ПодчиненныеЭлементы = ГоризонтальноеПоложениеЭлемента.Центр;
				
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
		
		ЗначениеОбследования = ТалицаВводимогоТекста.НайтиСтроки(Новый Структура("Реквизит",Элемент.ЗначениеМеню));
		
		ЗаголовокЗуб = "";
		Если ЗначениеЗаполнено(ЗначениеОбследования) Тогда
			Для Каждого ЭлМассив Из ЗначениеОбследования Цикл
				Если ЗначениеЗаполнено(ЭлМассив.ЗубЗначение) Тогда
					Если СтрНайти(ЗаголовокЗуб, Строка(ЭлМассив.ЗубЗначение)) = 0 Тогда
						ЗаголовокЗуб = ЗаголовокЗуб + "(" + Строка(ЭлМассив.ЗубЗначение) + ")";
					КонецЕсли;
				Иначе                                                                  
					Если СтрНайти(ЗаголовокЗуб, "(*)") = 0 Тогда
						ЗаголовокЗуб = ЗаголовокЗуб + "(*)";                               
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		// Добавим кнопку переключателя
		НовыйЭлемент_Кнопка 					= Элементы.Добавить(СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(" ,",Элемент.ЗначениеМеню.Наименование, ""), Тип("КнопкаФормы"), НоваяГруппа);
		НовыйЭлемент_Кнопка.Заголовок 			= СокрЛП(Элемент.ЗначениеМеню.Наименование) + ЗаголовокЗуб; 
		Если СтрДлина(НовыйЭлемент_Кнопка.Заголовок) > 20 Тогда
			НовыйЭлемент_Кнопка.ВысотаЗаголовка = 2;
		КонецЕсли;
		НовыйЭлемент_Кнопка.ЦветТекста 			= Новый Цвет(51, 51, 51);
		НовыйЭлемент_Кнопка.Шрифт 				= Новый Шрифт("Arial", 10);
		НовыйЭлемент_Кнопка.ОтображениеФигуры 	= ОтображениеФигурыКнопки.Нет;
		НовыйЭлемент_Кнопка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
		НовыйЭлемент_Кнопка.РастягиватьПоГоризонтали = Истина;
		// Добавим команду
		НоваяКоманда 							= Команды.Найти(СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(" ,",Элемент.ЗначениеМеню.Наименование, ""));
		Если НоваяКоманда = Неопределено Тогда 
			НоваяКоманда 						= Команды.Добавить(СтроковыеФункцииКлиентСервер.ЗаменитьОдниСимволыДругими(" ,",Элемент.ЗначениеМеню.Наименование, ""));
			НоваяКоманда.Действие 				= "Подключаемый_ОткрытьЭлементОбследования";				
		КонецЕсли;
		НовыйЭлемент_Кнопка.ИмяКоманды 			= НоваяКоманда.Имя;
		
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
// Процедура - Заблокировать записи по приему.
//
// Параметры:
//  Прием	 - 	 - 
//
Процедура ЗаблокироватьЗаписиПоПриему(Прием, Отказ)
	
	 Если ЗначениеЗаполнено(Прием) Тогда 
			
		Запрос = новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияПараметровОбследований.Документ КАК Документ,
		|	ЗначенияПараметровОбследований.ШаблонОбследования КАК ШаблонОбследования,
		|	ЗначенияПараметровОбследований.Параметр КАК Параметр,
		|	ЗначенияПараметровОбследований.Зуб КАК Зуб,
		|	ЗначенияПараметровОбследований.Значение КАК Значение,
		|	ЗначенияПараметровОбследований.ПорядковыйНомер КАК ПорядковыйНомер,
		|	ЗначенияПараметровОбследований.ЗначениеСтрокой КАК ЗначениеСтрокой
		|ИЗ
		|	РегистрСведений.ЗначенияПараметровОбследований КАК ЗначенияПараметровОбследований
		|ГДЕ
		|	ЗначенияПараметровОбследований.Документ = &Прием";
		
		Запрос.УстановитьПараметр("Прием", Прием);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда 
			
			Выборка = РезультатЗапроса.Выбрать();			
			РегистрСв = РегистрыСведений.ЗначенияПараметровОбследований;
			
			Пока Выборка.Следующий() Цикл	
				СтруктураСтроки = Новый Структура;
				
				СтруктураСтроки.Вставить("Документ"				, Выборка.Документ);
				СтруктураСтроки.Вставить("ШаблонОбследования"	, Выборка.ШаблонОбследования);
				СтруктураСтроки.Вставить("Параметр"				, Выборка.Параметр);
				СтруктураСтроки.Вставить("Зуб"					, Выборка.Зуб);
				СтруктураСтроки.Вставить("Значение"				, Выборка.Значение);
				
				Попытка
					ЗаблокироватьДанныеДляРедактирования(РегистрСв.СоздатьКлючЗаписи(СтруктураСтроки),, Этаформа.УникальныйИдентификатор);	
				Исключение 
					ОбщегоНазначения.СообщитьПользователю(ИнформацияОбОшибке().Причина.Описание);
					Отказ = Истина;
					Прервать;
				КонецПопытки;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
// Процедура - Подключаемый открыть элемент обследования
//
Процедура Подключаемый_ОткрытьЭлементОбследования(Элемент)
	
	ИскомаяЗакладка = ТалицаВводимогоТекста.НайтиСтроки(Новый Структура("ЗначениеЗакладки, ЗубЗначение", ПредЗакладка, ПредЗуб));
	Если ИскомаяЗакладка.Количество() > 0 Тогда
		ИскомаяЗакладка[0].ВводимыйТекст = ВводимыйТекст;
	ИначеЕсли ЗначениеЗаполнено(ВводимыйТекст) Тогда
		НоваяСтрока = ТалицаВводимогоТекста.Добавить();
		НоваяСтрока.ЗначениеЗакладки 		= ПредЗакладка;
		НоваяСтрока.ВводимыйТекст 	 		= ВводимыйТекст;
        НоваяСтрока.РеквизитИдентификатор 	= Новый УникальныйИдентификатор;  

		НоваяСтрока.ЗубЗначение 	 		= Элемент.ЗубЗначение; 
		НоваяСтрока.РеквизитЗначениеСтрокой = Элемент.РеквизитЗначениеСтрокой;
		НоваяСтрока.РеквизитЗначение        = Элемент.РеквизитЗначение;
		НоваяСтрока.Реквизит                = Элемент.Реквизит;
		НоваяСтрока.ЗубИдентификатор        = Элемент.ЗубИдентификатор;
					
	КонецЕсли;
	ПредЗакладка = Элемент.Имя;
	ИскомаяЗакладка = ТалицаВводимогоТекста.НайтиСтроки(Новый Структура("ЗначениеЗакладки", ПредЗакладка));
	ВводимыйТекст = "";
	Если ИскомаяЗакладка.Количество() > 0 Тогда
		Для Каждого ЭлМассива Из ИскомаяЗакладка Цикл 
			Если Не ЗначениеЗаполнено(ЭлМассива.ЗубЗначение) Тогда
				ВводимыйТекст = ЭлМассива.ВводимыйТекст;              
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли; 
	
	МассивЗаголовков = СтруктураМеню.НайтиСтроки(Новый Структура("ЗначениеБезПробелов", Строка(ПредЗакладка)));
	Если ЗначениеЗаполнено(МассивЗаголовков) Тогда
		ЭтаФорма.Заголовок = Строка(МассивЗаголовков[0].ЗначениеМеню);
	КонецЕсли;
	
	УстановитьАктивнуюЗакладку(Строка(ПредЗакладка));
	МассивВыделенныхЗубов.Очистить();
	ОбновитьSVGПодбор();
	
КонецПроцедуры

&НаСервере 
// Процедура - устанавливает активную закладку
//
Процедура УстановитьАктивнуюЗакладку(Закладка);
	
	// Убираем выделение групп.
	Для каждого Группа Из Элементы.ГруппаОбследование.ПодчиненныеЭлементы Цикл
		Если Группа.Имя <> "ДекорацияЗаглушка" Тогда
			Группа.ЦветФона = Новый Цвет(242, 242, 242);
			Для каждого Кнопка Из Группа.ПодчиненныеЭлементы Цикл
				Кнопка.ЦветТекста = Новый Цвет(77, 77, 77);
			КонецЦикла;                
		КонецЕсли;
	КонецЦикла;
	
	// Устанавливаем выделение выбранной группы метода авторизации.
	Элементы.Найти(Закладка).Родитель.ЦветФона = Новый Цвет(25 , 116, 206);
	Элементы.Найти(Закладка).ЦветТекста = Новый Цвет(255, 255, 255); 
	
	МассивЗаголовков = СтруктураМеню.НайтиСтроки(Новый Структура("ЗначениеБезПробелов", Строка(Закладка)));
    Если ЗначениеЗаполнено(МассивЗаголовков) Тогда
		ИскомаяЗакладка = Строка(МассивЗаголовков[0].ЗначениеМеню);
		Элементы.ГруппаПодборЗубов.Видимость = ПланыВидовХарактеристик.ПараметрыОбследований.НайтиПоНаименованию(ИскомаяЗакладка).ПривязкаКЗубам;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти
